[{
    "quote": "We utilized Mystic to provide us with several web applications to enhance the content and functionality of our website.  They worked with our team to understand our needs and requirements that resulted from redesigning our website.  The solutions they provided were designed well and delivered on time and within budgetary requirements. These applications are some of the most popular locations on our site.",
    "author": "- Brian Harris, Executive Director Web Operations at Loma Linda University Medical Center"
},
{
    "quote": "Mystic and Thoughtwave have been developing software applications for many many years.  From Swing app visualizations to better understand huge datasets to proof of concept network services to enable communication for some new stuff we're currently developing.  They've brought in the knowledge and team needed to ferret out the right solution for our business need.",
    "author": "- Chuck Asbury, Owner at Aerosimulators"
},
{
    "quote": "Mystic lives and breathes technology and software best practices.  At a time when the content management space was high-end commercial out of reach software, and low-end useless, they built a custom solution that powered a very important client for half a decade, which is a really long time for the internet.",    
    "author": "- Tony Crisp, CEO at CRISP^YHKG"
},
{
    "quote": "There are certain people in the industry which you can talk shop with, and feel like they are part of your inner circle.  Mystic's team has a wealth of technology experience and the ability to communicate and have fun with it.  They remain one of an inner circle of trusted colleagues for their insight and knowledge.",
    "author": "- Eugene Ciurana, Walmart.com, LeapFrog.com"
},
{
    "quote": "Mystic worked with us at Nuance on several critical projects within our infrastructure.  They have excellent technical and communication skills and were very easy to work with. The team has been a key asset in development and consulting on our products at Nuance.  We definitely recommend working with Mystic on your next project.",
    "author": "- Barbara Bartoszek, Sr. Product Marketing Manager, Nuance Communications"
}]